export type Transaction = {
  id: string;
  date: string; 
  type: 'income' | 'expense';
  amount: number;
  category: string;
  notes?: string;
  createdAt: number; 
};

export const popularCategories = {
  income: [
    'বেতন', 
    'ব্যবসা', 
    'ফ্রিল্যান্সিং', 
    'উপহার', 
    'বোনাস', 
    'বিনিয়োগ/মুনাফা', 
    'ভাড়া (প্রাপ্ত)', 
    'বিক্রয়', 
    'কমিশন',
    'অন্যান্য'
  ],
  expense: [
    'বাজার/মুদি',
    'খাবার ও নাস্তা',
    'যাতায়াত/ভাড়া',
    'বাসা ভাড়া',
    'বিদ্যুৎ/গ্যাস/পানি বিল',
    'মোবাইল ও ইন্টারনেট',
    'কেনাকাটা (পোশাক/জুতা)',
    'চিকিৎসা ও ঔষধ',
    'শিক্ষা (ফি/বই)',
    'পরিবার ও সন্তান',
    'বিনোদন ও ঘোরাঘুরি',
    'ব্যক্তিগত যত্ন (পার্লার/সেলুন)',
    'উপহার ও দান',
    'ঋণ বা কিস্তি (EMI)',
    'গাড়ি/বাইক মেইনটেন্যান্স',
    'বীমা (Insurance)',
    'সাবস্ক্রিপশন (Netflix/Gym)',
    'গৃহস্থালি সরঞ্জাম',
    'জরুরি খরচ',
    'অন্যান্য'
  ]
};